{"names":["conditions","home basin express","saddle quad chair","nicen easy platter","home basin terrain","saddle basin terrain","matukituki basin terrain","motatapu basin terrain","summit slopes basin terrain","jazz intermediate park terrain","jazz kids train terrain"],"values":[["2022-08-01",15,20,35,"NW","NW","NW","some clouds","light snow","heavy snow",0,1,10,0,0,0,750,1300,1550,"We have a cold, clear start to the day with moderate SW winds. The snow continues to be in good, wintery skiing condition and those moderate winds will mean plenty of pockets of good wind swept snow in the many gullies out there, making for plenty of fun to be had both on and off piste. Tonight's weather will hopefully bring some more snow, watch this space!\n\nWe continue to have some terrain closures due to avalanche concerns, with Chutes open from Gate 3. Stay safe.","OPEN","OPEN","OPEN","OPEN","OPEN","OPEN","OPEN","OPEN","OPEN","OPEN"],["2022-07-31",10,10,5,"SSW","SW","WSW","clear","some clouds","clear",0,0,0,0,0,0,0,1150,0,"A gorgeous Sunday ahead for you all. Yet another clear and cold night with light breezes means the snow conditions continue to improve across the mountain along with ideal grooming and snowmaking conditions we're expecting a fantastic day of skiing and boarding for everyone.\nThe 'Ride Tribe' program kicks off today and we're looking forward to seeing you all up here!\n\nWe continue to have some terrain closures due to avalanche concerns in some areas in place for your safety.","OPEN","OPEN","OPEN","OPEN","OPEN","OPEN","OPEN","OPEN","OPEN","OPEN"],["2022-07-30",15,5,15,"NW","S","SSE","cloudy","cloudy","some clouds",0,0,0,0,0,0,500,1050,0,"We received a dusting of fresh snow yesterday evening just to freshen the place up a bit, but it was mostly a clear, calm and cold night making for great conditions for both grooming and snowmaking; both of which has been done extensively across the mountain. We're looking at a mostly fine day with some more snow showers forecast to set in later in the day. \n\nWe continue to have some terrain closures due to avalanche concerns in some areas in place for your safety.","OPEN","OPEN","OPEN","OPEN","OPEN","OPEN","ON HOLD","OPEN","OPEN","OPEN"],["2022-07-29",10,10,10,"WNW","NW","NW","snow shwrs","light snow","snow shwrs",0,3,0,0,0,0,1150,1150,0,"Happy Friday! It's a beautiful sunny day. Currently clear and calm with plenty of overnight grooming should make for some superb skiing and riding. With such great coverage over the whole mountain there are plenty of awesome runs to be had both on and off piste. A great day to come up for an early morning run followed by a nice lunch with magic views. See you up here!\n\nBack country gate at the top of Sundance is open, however Sundance is closed with no access.","OPEN","OPEN","OPEN","OPEN","OPEN","OPEN","ON HOLD","OPEN","OPEN","OPEN"],["2022-07-28",5,5,5,"SSW","WSW","W","light snow","cloudy","light snow",0,0,1,0,0,0,1100,1300,1100,"9:30am Update - All lifts are open, we are above the cloud and its a beautiful calm day up here. Run of the days is the Summit!\nThe snow is skiing/riding really nicely today, especially on trail. The grooming team have splashed plenty of cord across the maunga and off trail will be fun too, although take caution for a crust lurking out there. We're looking forward to a great day, so come up and explore!","OPEN","OPEN","OPEN","OPEN","OPEN","OPEN","ON HOLD","OPEN","OPEN","OPEN"],["2022-07-27",5,5,5,"E","ENE","N","light snow","light snow","light snow",0,1,1,0,0,0,1100,1150,1000,"Great skiing in Main Basin with awesome new snow and not bad visibility. Plenty of good turns to be had on and off trail!\nSaddle Basin visibility is still horrendous and the lift is really badly iced up (worst we've seen for long time). So we will keep working on things but expect this will take several hours and we may not get the Saddle today. Fingers crossed the sun comes out to help!\nWe will keep updating.","OPEN","DELAYED","OPEN","OPEN","DELAYED","OPEN","CLOSED","DELAYED","OPEN","OPEN"],["2022-07-26",10,10,10,"ESE","ESE","ESE","light snow","light snow","light snow",4,1,2,0,0,0,1050,1150,1100,"It's a good ol' fashioned storm riding day! With new, dry snow and forecast to continue snowing all day there will be lovely conditions to enjoy. We could pickup another 5/10cm through the day. Low light lenses, a few coffee stops and some great skiing/riding, especially on the groomers which have a dusting of pow on top! Main Basin will open 9am, we'll assess Saddle once Patrol arrive and start to setup. Pack you jacket and ensure your vehicle has chains, it's snow time!","OPEN","ON HOLD","OPEN","OPEN","ON HOLD","ON HOLD","CLOSED","ON HOLD","OPEN","OPEN"],["2022-07-25",5,5,10,"ESE","ESE","ESE","cloudy","cloudy","light snow",0,0,2,0,0,0,850,900,750,"Another great looking day following yet another clear, calm and cold night, with these conditions the skiing continues to improve each day coupled with lots grooming and snowmaking and not to mention, we're currently sitting above that thick, low inversion cloud means its looking like a fantastic start to the week up here! \nPlease obey all ski area closures, they are in place due to avalanche concerns in some areas and are for your safety.","OPEN","OPEN","OPEN","OPEN","OPEN","OPEN","CLOSED","OPEN","OPEN","OPEN"],["2022-07-24",5,0,5,"W","W","ESE","some clouds","cloudy","cloudy",0,0,0,0,0,0,1400,1350,950,"A beautiful Sunday with wintery snow all over the mountain, loads of grooming and fine weather in the forecast ahead. School holidays are wrapping up so last chance for a winter shred before getting back to school tomorrow for some of you, and we're likely to see less crowds today; could be a good day for those of you that don't like sharing!\n\nPlease obey all ski area closures, they are in place due to avalanche concerns and are for your safety.","OPEN","OPEN","OPEN","OPEN","OPEN","OPEN","CLOSED","OPEN","OPEN","OPEN"],["2022-07-23",10,10,5,"NW","NW","NW","clear","some clouds","clear",0,0,0,0,0,0,0,1500,950,"9am update. We have lighter traffic flow today and plenty of car parking spaces left. The groomers have laid heaps of cord and the off-trail has been chopped up to some mid-winter goodness. Come on up and enjoy a sunny day at the Cone!\n\nPlease obey all closures. Loss of pass for closure break in.\nMotatapu Chutes will remain closed for avalanche hazard. Sundance Back Country is closed today.\n11:30: South Ridge is open.","OPEN","OPEN","OPEN","OPEN","OPEN","OPEN","CLOSED","OPEN","OPEN","OPEN"],["2022-07-22",10,0,5,"SE","NE","N","some clouds","clear","some clouds",0,0,0,0,0,0,0,1100,0,"9am update. We have lighter traffic flow today and plenty of car parking spaces left. The groomers have laid heaps of cord and the off-trail has been chopped up to some mid-winter goodness. Come on up and enjoy a sunny day at the Cone!\n\nPlease obey all closures. Loss of pass for closure break in.\nMotatapu Chutes will remain closed for avalanche hazard. Sundance Back Country is closed today.","OPEN","OPEN","OPEN","OPEN","OPEN","OPEN","CLOSED","OPEN","OPEN","OPEN"],["2022-07-21",10,10,10,"SSE","SSE","SE","cloudy","some clouds","some clouds",0,0,0,0,0,0,850,850,0,"Mōrena, it's Rāpare/Thursday and we are OPEN!\nThe groomers have laid a good amount of cord around the hill for a nice morning blast. There's a lot of snow out there, in various states, some good, some challenging - take care, and enjoy.\nWe're shooting to open Main Basin at 9am once Patrol complete control work. We will then work towards the Saddle - we have a complex snowpack to assess and make safe so will keep updating how we get on.\nSee you up here!","OPEN","ON HOLD","OPEN","OPEN","ON HOLD","ON HOLD","ON HOLD","ON HOLD","OPEN","OPEN"],["2022-07-20",5,5,10,"ESE","SE","SSE","light snow","light snow","light snow",2,0,0,0,0,0,1100,1100,900,"9:30am Update\n\nGeotechnical assessment of the access road is going to take several hours and we may have to do some remedial work to ensure the road is safe to open.  This will realistically take all day.\n\nOur team on the hill are getting everything ready for a great day tomorrow!","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","OPEN","OPEN"],["2022-07-19",5,5,5,"NE","ENE","ENE","mod. snow","light snow","light snow",9,4,4,0,0,0,1300,1100,950,"Unfortunately the swinging fortunes of the NZ winter continue and we have received a lot of rain in the main basin, on top of all the new snow. The snow is currently unskiable and the groomers can't climb up it, as it's so wet. So we will remain CLOSED today to let it drain out and dry out, which with forecast southerly change will bring colder temps.","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","OPEN","OPEN"],["2022-07-18",40,40,25,"NW","NNW","NNW","mod. snow","heavy snow","heavy snow",6,15,27,0,0,0,1800,1900,1800,"CLOSED today due to a large storm which is already delivering winds in excess of 90kph, heavy precipitation and very poor visibility. And the forecast is for this to increase through the day! \nA big ol' Nor' Wester has rolled in and we are in the midst of it. We've battened down the hatches and expect to receive a lot of snow, especially up high!","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","OPEN","OPEN"],["2022-07-17",25,30,25,"NNW","NW","NNW","light snow","heavy snow","heavy snow",2,12,30,0,0,23,1150,1350,1750,"With lots of great skiing on wintery snow right across the resort and loads of grooming in both basins, we're looking good to get our Sunday started on the mountain. We're expecting the next storm cycle to arrive today, which will hopefully bring us more snow. However, it will also bring some strong winds which may affect operations, we'll monitor this closely and keep you updated. We're looking good this morning to get skiing out there so come on up nice and early!","OPEN","OPEN","OPEN","OPEN","OPEN","OPEN","CLOSED","CLOSED","OPEN","OPEN"],["2022-07-16",10,10,15,"SSW","W","NW","clear","clear","snow shwrs",0,0,0,0,0,0,0,1200,0,"Yet another fantastic winters day on the mountain today. Continuing cold temperatures are making for excellent snowmaking and grooming conditions making for great skiing and boarding on piste and great snow coverage across the mountain with cold, chalky snow means there is plenty of fun to be had off piste right across the resort. We should have all terrain open early on. \n\nAs good as it is, there's potentially more snow with a bit of weather on the way early next week too!","OPEN","OPEN","OPEN","OPEN","OPEN","OPEN","OPEN","OPEN","OPEN","OPEN"],["2022-07-15",10,10,5,"S","SSW","SW","cloudy","cloudy","some clouds",0,0,0,0,0,0,0,900,200,"Good morning!  We have fantastic wintery snow conditions over the whole mountain with plenty of grooming in the Home Basin and Saddle. It will be another great day up here with cool temps overnight allowing the snowmakers to top up those Home Basin runs.  We will aim to have all terrain open, with some cloud forecast for the day it may affect The Chutes opening.  Overall it will be a great day up here, dress warm!\n\n9am: Saddle Basin is open, Summit and Chutes on hold.","OPEN","OPEN","OPEN","OPEN","OPEN","OPEN","OPEN","OPEN","OPEN","OPEN"],["2022-07-14",10,5,5,"SW","SW","SE","some clouds","some clouds","snow shwrs",0,0,0,0,0,0,750,1000,200,"Fabulous! Another cold night, some wind to refill the gullies, and still plenty nice powder skiing/riding to be had across the Maunga. The groomers have laid plenty perfect cord which will be superb off the bat. On trail, off trail you can pretty much ski everywhere right now, and it is good, oh so good! Come up and enjoy mighty fine conditions in what looks to be a fine weather day. \nMain basin opens 9am, Saddle a wee bit after once Patrol finish control work.","OPEN","OPEN","OPEN","OPEN","OPEN","OPEN","ON HOLD","OPEN","OPEN","OPEN"],["2022-07-13",10,10,10,"SSW","SW","SW","light snow","cloudy","cloudy",2,0,0,0,0,0,1000,1150,900,"More snow! It just keeps coming down, light and dry. There will be superb skiing, especially Main Basin where visibility will be better. Groomers have flattened out the trails and there's fresh pow on top! Forecasted SW wind this afternoon may reduce our operation.\nChains are required on ALL VEHICLES from the bottom as we have a very snowy road. Our shuttle service will only have limited capacity, so carpool with your family and mates.","OPENS AT 9AM","DELAYED","OPENS AT 9AM","OPEN","DELAYED","OPEN","CLOSED","ON HOLD","OPEN","OPEN"],["2022-07-12",20,15,5,"E","E","SE","light snow","light snow","light snow",2,2,3,0,0,0,900,1000,850,"Come on up and enjoy the fantastic conditions that continue to be served in 2022. Today's trails will be superb from the start, with another great night of perfect grooming. Off trail is pretty delightful with the cold, dry snow making for heaps of fun out there. \nWe have another storm lining up later today day, bringing more snow to lower levels, happy days! We will monitor the summit and chutes for visibility as the morning progresses.","OPEN","OPEN","OPEN","OPEN","OPEN","OPEN","ON HOLD","ON HOLD","OPEN","OPEN"],["2022-07-11",5,5,5,"E","ENE","E","cloudy","cloudy","cloudy",0,0,0,0,0,0,0,1400,950,"With cold temps and low humidity over the past 36 hours the snow right across the mountain has dried out and is skiing awesomely! We made some quality snow in the Home Basin last night and groomed lots of trails across the mountain. We anticipate being able to open the Motutapu Chutes for the first time this season today, which will also be skiing very well. All of this combined with a fine day with light winds in the forecast adds up to a near perfect day on the mountain!","OPEN","OPEN","OPEN","OPEN","OPEN","OPEN","DELAYED","OPEN","OPEN","OPEN"],["2022-07-10",10,10,10,"ESE","SE","E","cloudy","cloudy","cloudy",0,0,0,0,0,0,0,650,0,"Having received 40cm of snow a couple days ago which then got soaked by rain and warm temps it's now cooled right down again and given the snow a chance to dry out. That coupled with plenty of grooming across the mountain, snowmaking in the Home Basin and with a fine, cold day forecast we expect a good Sunday. Conditions off piste will be a bit tricky with a combination of new snow, old snow and a breakable crust in-between we advise taking extra care.","OPEN","DELAYED","OPEN","OPEN","DELAYED","OPEN","CLOSED","DELAYED","OPEN","OPEN"],["2022-07-09",15,15,15,"SSE","SE","ESE","light snow","light snow","light snow",4,1,2,0,0,0,1600,1150,500,"It was awesome to see snow setting in yesterday with us receiving 40cm of new snow at the top of the 6 throughout the day, however things warmed up a fair a bit and we received rain through the night last night. So, there is fresh snow however, it is quite heavy and also made for some tricky grooming last night. We are currently ON HOLD while we assess the snowpack for safety and will update you at 7am","ON HOLD","ON HOLD","ON HOLD","ON HOLD","ON HOLD","CLOSED","CLOSED","ON HOLD","OPEN","OPEN"],["2022-07-08",10,15,5,"NE","NNE","N","heavy snow","mod. snow","mod. snow",14,6,5,0,0,0,800,1000,1600,"Well folks after an awesome start to the season, just when we thought a top up was due, mother nature has delivered! Unfortunately due to strong winds, very poor visibility and the the valley road being a bit snowed over we are unable to open safely today and will be closed.\nWe have received 15cm of new snow and its currently snowing heavily to low levels. The forecast is due to for the weather improve moving in to tomorrow so we hope to see you here for an epic powder day!","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","OPEN","OPEN"],["2022-07-07",5,0,5,"NW","NE","NE","clear","some clouds","cloudy",0,0,0,0,0,0,2450,2050,1650,"Overnight low humidity has kept the snow cold and dry, with the grooming and snowmaking teams giving things a freshen up. On trail we will continue to have fantastic skiing/riding and off trail there's some nice chalky wind buff, esp. in gullies - it'll be firm at first then softening a touch once old yellow gets up into the sky.  Grab some turns and grab some lunch in the sunshine - Pizzas are looking mighty fine in the cafe, Altitude and by beginner skiers on the Platter.","OPEN","OPEN","OPEN","OPEN","OPEN","OPEN","CLOSED","OPEN","OPEN","OPEN"],["2022-07-06",5,5,5,"S","WSW","NW","clear","clear","clear",0,0,0,0,0,0,1300,2250,2350,"Another excellent day of skiing/riding at the Cone with cold, dry snow. The groomers are superb, there's nice bits of wind blown goodness to be found and from late morning the sun will make areas like Matuki and Sundance a soft and creamy dream. It's nice and quiet as we're still pre school hols, so come up and get some sensational turns in the sunshine.","OPEN","OPEN","OPEN","OPEN","OPEN","OPEN","CLOSED","OPEN","OPEN","OPEN"],["2022-07-05",20,20,15,"NW","WNW","WSW","snow shwrs","light snow","some clouds",0,0,0,0,0,0,1400,1350,1450,"The skiing/riding right now is immense. Top to bottom, left to right there are options everywhere and plenty of chalky wintery goodness to find. Laps, laps and more laps until your legs start to scream then head to Altitude for a well earned beer and pizza or try one of the new milkshakes at 1260. Then burn it all off with a cheeky summit hike. Sounds like a good day to me!","OPEN","OPEN","OPEN","OPEN","OPEN","OPEN","CLOSED","OPEN","OPEN","OPEN"],["2022-07-04",10,15,20,"NW","WNW","NW","clear","clear","some clouds",0,0,0,0,0,0,1950,1500,1400,"Its looking like a great start to the week here at TC. Plenty of good snow coverage and loads of grooming across the mountain will make for great skiing and boarding. The forecast is for a fine day with light winds. Not bad for a Monday, come get it!\n\n\nWith a relatively warm day in the forecast we'll be watching some areas of funky snow closely, please obey all ski area signage and closures.","OPEN","OPEN","OPEN","OPEN","OPEN","OPEN","CLOSED","OPEN","OPEN","OPEN"],["2022-07-03",10,15,10,"WNW","WNW","W","some clouds","some clouds","some clouds",0,0,0,0,0,0,1350,1500,1550,"We're well and truly looking like a winter wonder land up TC today. Great snow coverage with loads of groomed trails making for great skiing and boarding right across the mountain. A bit of a scrappy start to the day weather wise, with a dusting of new snow and moderate to strong westerly winds. This weather should pass pretty early on making way for a beautiful Sunday on the mountain. There continues to be some terrain closures in place, please obey all ski area signage.","OPEN","OPEN","OPEN","OPEN","OPEN","OPEN","CLOSED","OPEN","OPEN","OPEN"],["2022-07-02",10,10,15,"WNW","WNW","NW","clear","some clouds","light snow",0,0,2,0,0,0,1500,1550,1450,"We've got some amazing early season snow coverage out there with loads of groomed trails and great skiing to be had both on and off piste. There will be lots of stashes and pockets of wind blown winter snow out there, particularly out in the Saddle Basin. Our Patrol team will have some avalanche control work to carry out with those wind loaded start zones so there may be a slight delay (if any) getting the Saddle open, we'll keep you posted on progress!","OPEN","OPEN","OPEN","OPEN","OPEN","OPEN","CLOSED","OPEN","OPEN","OPEN"],["2022-07-01",15,15,10,"W","W","W","clear","some clouds","some clouds",0,0,0,0,0,0,0,1150,1150,"It is looking like a classic winters day up here, continuing cold temperatures have kept the snow in great skiing condition combined with a top up of 5cm of wind effected snow over night should make for some great skiing and snowboarding out there. With cold temps and the chance of winds increasing later in the day it will be chilly out there so dress warm.  There are some terrain closures in place, obey all ski area signage.","OPEN","OPEN","OPEN","OPEN","OPEN","OPEN","CLOSED","OPEN","OPEN","OPEN"],["2022-06-30",20,30,15,"NW","NW","WSW","light snow","mod. snow","snow shwrs",1,6,1,0,0,0,1350,1450,0,"Mid winter conditions are providing glorious skiing/riding across the maunga. The grooming team are reveling in laying down heaps of cord - Saddle Back and Bullet groomed up for 1st time! Off trail is excellent, providing top to bottom laps, with plenty fresh pockets still to be found. Awesome to be giving the legs such a work out early season! Wee bit more of a scrappy weather day, with a front moving onto us as day progresses, but should start off good.","OPEN","OPEN","OPEN","OPEN","OPEN","OPEN","CLOSED","OPEN","OPEN","OPEN"],["2022-06-29",15,15,10,"WNW","W","WNW","snow shwrs","some clouds","some clouds",0,0,0,0,0,0,1150,1500,1450,"Whoa! What a day yesterday and today will be just as good with 40+cms in the Saddle and still heaps untracked, especially on the summit. The whole mtn is a smorgasbord of delight with cold temps overnight and no wind keeping the snow superb. The groomers will be superb today and off-trail there's plenty to ski. Powder Bowl, Sundance, Chutes and skiers right of Mineshaft are closed, everything else is on!","OPEN","OPEN","OPEN","OPEN","OPEN","OPEN","CLOSED","OPEN","OPEN","OPEN"],["2022-06-28",5,5,10,"ENE","WNW","WNW","light snow","some clouds","cloudy",0,0,0,0,0,0,750,1050,0,"We are going for an OPEN in main basin at 9am or possibly a wee bit after. Saddle significantly delayed, we'll be working hard to get it, but there's a chance we might not as we have some stubborn avalanche hazard out there. Expect Powder Bowl and Magnum to be closed, but hopefully Matukituki open.\nWe have 12cm slightly heavy snow in car park and 30+cm dry snow top of 6, with no wind and it is still snowing. Should be great skiing up top!","OPENS AT 9AM","ON HOLD","OPENS AT 9AM","OPEN","ON HOLD","ON HOLD","CLOSED","ON HOLD","OPEN","OPEN"],["2022-06-27",20,5,5,"NNW","WNW","SE","light snow","mod. snow","mod. snow",3,6,6,0,0,0,1550,1350,1000,"The forecasted front is starting to hit which will bring a blast of rain on road and lower mtn with snow higher up. This will increase our current tricky avalanche problem on both field and above road to a point we can't safely manage. So we will be CLOSED today. There are cold temps in behind and with a clear night we'll be back in action tomorrow, hopefully with a nice few cms of snow to play with!","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","OPEN","OPEN"],["2022-06-26",10,10,20,"NW","NW","NNW","some clouds","some clouds","light snow",0,0,1,0,0,0,1650,1700,1600,"We had a few cms of snow on very upper mtn and rain below, drying out overnight with clear skies. Snow will be firm first thing, but will continue to soften throughout the day. We are opening the Home Basin 9AM to allow things to soften a touch. We have some really nice, firm snow on the summit and upper Saddle. All groomers are skiing really nicely on mountain.\n\nPatrol reporting really nice turns off the summit, if you're keen for it today we definitely recommend the hike.","OPEN","DELAYED","OPEN","OPEN","DELAYED","OPEN","CLOSED","DELAYED","OPEN","OPEN"],["2022-06-25",15,10,10,"NNW","NW","NW","light snow","light snow","snow shwrs",1,2,0,0,0,0,1800,1700,1750,"We have received a short heavy rainfall overnight on lower mtn and road, with more forecast during day. This has increased our avalanche hazard, particularly above the road, and as a result we cannot safely open today. Tonight the temp will drop and we may have a clearance so the snow will hopefully stabilise. The early season huge snowfall is a long term blessing but has created short term challenges. So rest up, and we'll be back into what will be an excellent winter ahead.","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","OPEN","OPEN"],["2022-06-24",15,15,20,"NNW","NNW","NNW","some clouds","light snow","light snow",0,0,5,0,0,0,1750,1800,1850,"Superb conditions across the mountain, the grooming in main basin is particularly excellent! Off trail there is some great snow but also some crust and scoured pockets so please take care and remember it's day 1! We also have some avalanche hazard that may develop with sun and may cause terrain closures.\nHAPPY OPENING DAY EVERYONE!","OPEN","OPEN","OPEN","OPEN","OPEN","OPEN","CLOSED","OPEN","OPEN","OPEN"],["2022-06-23",10,10,10,"NNW","NNW","NW","cloudy","some clouds","clear",0,0,0,0,0,0,1950,1700,1650,"We have superb conditions all across the mountain. We're currently building the trails, clearing the road and car parks and setting up the resort. There's still a lot to do, but we will be ready to open on FRIDAY 24th JUNE. See you then!","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","OPEN","OPEN"],["2022-06-22",5,5,10,"NNW","NW","NNW","clear","clear","some clouds",0,0,0,0,0,0,2300,2150,2000,"We're stoked that this storm has provided us with whats looking like the best start to winter we've had in some time. With the weather clearing we've been able to get out there and start prepping the mountain for an epic opening day!\nWe're due to open for the winter season of '22 on the 25th June and what an opening it's going to be!!","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","OPEN","OPEN"],["2022-06-21",5,0,0,"SE","ESE","NE","clear","clear","clear",0,0,0,0,0,0,2500,2400,2400,"We're stoked that this storm has provided us with whats looking like the best start to winter we've had in some time. With the weather clearing we've been able to get out there and start prepping the mountain for an epic opening day!\nWe're due to open for the winter season of '22 on the 25th June and what an opening it's going to be!!","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","OPEN","OPEN"],["2022-06-20",10,10,10,"SE","SE","SE","some clouds","clear","clear",0,0,0,0,0,0,950,1450,2450,"We're stoked that this storm has provided us with whats looking like the best start to winter we've had in some time. With the weather clearing we've been able to get out there and start prepping the mountain for an epic opening day!\nWe're due to open for the winter season of '22 on the 25th June and what an opening it's going to be!!","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","OPEN","OPEN"],["2022-06-19",15,15,10,"S","SSE","SE","some clouds","cloudy","some clouds",0,0,0,0,0,0,1050,1200,950,"We're stoked that this storm has provided us with whats looking like the best start to winter we've had in some time. With the weather clearing we've been able to get out there and start prepping the mountain for an epic opening day!\nWe're due to open for the winter season of '22 on the 25th June and what an opening it's going to be!!","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","OPEN","OPEN"],["2022-06-18",5,5,5,"W","S","S","some clouds","some clouds","some clouds",0,0,0,0,0,0,1750,1650,950,"We're stoked that this storm has provided us with whats looking like the best start to winter we've had in some time. With the weather clearing we've been able to get out there and start prepping the mountain for an epic opening day!\nWe're due to open for the winter season of '22 on the 25th June and what an opening it's going to be!!","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","OPEN","OPEN"],["2022-06-17",5,5,10,"NNW","NW","NW","clear","clear","clear",0,0,0,0,0,0,1200,1650,1800,"We're stoked that this storm has provided us with whats looking like the best start to winter we've had in some time. With the weather clearing we've been able to get out there and start prepping the mountain for an epic opening day!\nWe're due to open for the winter season of '22 on the 25th June and what an opening it's going to be!!","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","OPEN","OPEN"],["2022-06-16",20,20,10,"WNW","WNW","W","light snow","light snow","snow shwrs",1,0,0,0,0,0,1350,1400,1450,"Well this storm has been incredible! We have received an almighty level of snow. This will take us some time to get on top of, as right now we can't even get to the resort with over 1m on the road. There is significant avalanche hazard everywhere that has to be assessed and managed, especially as the wind turns southerly and strengthens. Plenty to do!\nWe're due to open for the winter season of '22 on the 25th June and what an opening it's going to be!!","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","OPEN","OPEN"],["2022-06-15",25,20,15,"W","W","WNW","snow shwrs","snow shwrs","snow shwrs",0,1,0,0,0,0,1000,1300,1100,"Well this storm has been incredible! We have received an almighty level of snow. This will take us some time to get on top of, as right now we can't even get to the resort with over 1m on the road. There is significant avalanche hazard everywhere that has to be assessed and managed, especially as the wind turns southerly and strengthens. Plenty to do!\nWe're due to open for the winter season of '22 on the 25th June and what an opening it's going to be!!","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","OPEN","OPEN"],["2022-06-14",35,30,25,"W","W","WNW","snow shwrs","snow shwrs","snow shwrs",2,1,1,0,0,0,1200,1050,700,"Well this storm has been incredible! We have received an almighty level of snow. This will take us some time to get on top of, as right now we can't even get to the resort with over 1m on the road. There is significant avalanche hazard everywhere that has to be assessed and managed, especially as the wind turns southerly and strengthens. Plenty to do!\nWe're due to open for the winter season of '22 on the 25th June and what an opening it's going to be!!","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","OPEN","OPEN"],["2022-06-13",15,20,25,"SW","SW","W","light snow","snow shwrs","snow shwrs",0,1,2,0,0,0,150,1200,200,"Welcome to winter 2022! As we're looking down the barrel of an exciting pre season storm cycle over the coming week we'll keep the snow report updated as things develop. \nSo far we've received 35cm of snow at the top of the 6 with just about 5cm new snow at base down to about 1200m on the road. The forecast is for more snow tonight!\nWe're due to open for the winter season of '22 on the 25th June and we're super excited to see you all back up here.","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","OPEN","OPEN"],["2022-06-12",20,25,20,"N","NNW","NNW","heavy snow","heavy snow","heavy snow",35,18,35,0,0,0,1000,1100,850,"Welcome to winter 2022! As we're looking down the barrel of an exciting pre season storm cycle over the coming week we'll keep the snow report updated as things develop. \nSo far we've received 35cm of snow at the top of the 6 with just about 5cm new snow at base down to about 1200m on the road. The forecast is for more snow tonight!\nWe're due to open for the winter season of '22 on the 25th June and we're super excited to see you all back up here.","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","OPEN","OPEN"],["2022-06-11",30,30,30,"NW","WNW","NNW","heavy snow","snow shwrs","snow shwrs",12,3,14,0,0,0,900,600,550,"Welcome to winter 2022! As we're looking down the barrel of an exciting pre season storm cycle over the coming week we'll keep the snow report updated as things develop. \nSo far we've received 35cm of snow at the top of the 6 with just about 5cm new snow at base down to about 1200m on the road. The forecast is for more snow tonight!\nWe're due to open for the winter season of '22 on the 25th June and we're super excited to see you all back up here.","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","OPEN","OPEN"],["2022-06-10",20,25,35,"NW","N","WNW","snow shwrs","heavy snow","snow shwrs",2,21,15,0,0,0,900,1000,850,null,"CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","OPEN","OPEN"],["2022-06-09",10,15,15,"NNW","NW","NNW","mod. snow","light snow","heavy snow",8,0,24,0,0,0,1250,1250,1150,null,"CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","OPEN","OPEN"],["2022-06-08",15,10,10,"NW","N","NW","light snow","heavy snow","heavy snow",2,15,16,0,0,0,1500,1350,1300,null,"CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","OPEN","OPEN"],["2022-06-07",30,25,20,"NNW","NNW","NW","light snow","snow shwrs","light snow",5,5,5,0,0,0,1700,1600,1550,null,"CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","OPEN","OPEN"],["2022-06-06",5,10,25,"NNW","NNW","NNW","clear","some clouds","snow shwrs",0,0,0,0,0,0,2200,2200,2050,null,"CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","OPEN","OPEN"],["2022-06-05",25,20,15,"N","NNW","NNW","snow shwrs","light snow","snow shwrs",0,2,0,0,0,1,1650,1650,2000,null,"CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","OPEN","OPEN"],["2022-06-04",10,10,15,"NW","NW","N","some clouds","clear","some clouds",0,0,0,0,0,0,2250,2200,2100,null,"CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","OPEN","OPEN"]]}