{"names":["conditions","happy valley","rangatira","sky waka","cindertrack carpet","delta","valley t","knoll ridge t","west ridge quad","farwest t","pop up park"],"values":[["2022-08-29",10,5,5,"ESE","E","ENE","some clouds","some clouds","clear",0,0,0,0,0,0,1300,1850,1200,"The Happy Valley beginner area is open for ski and ride. We may reach capacity in Happy Valley later this morning for ski, ride and sledding so please check the report if you are coming later. The Sky Waka Gondola is open for sightseeing and access only. The Valley T, Knoll T and Far West T's are open for advanced ski and ride only.","OPEN","CLOSED","OPEN","CLOSED","CLOSED","OPEN","OPEN","CLOSED","OPEN","OPEN"],["2022-08-28",15,10,10,"SSE","SE","SE","clear","clear","some clouds",0,0,0,0,0,0,2150,2250,1550,"The Happy Valley beginner area is open for ski and ride. We expect to reach capacity in Happy Valley this morning for ski, ride, and sledding, so please check the report if you are coming later. The Sky Waka Gondola is open for sightseeing and access only. The Valley, Knoll, and Far West T's are open for advanced ski and ride only.","OPEN","CLOSED","OPEN","CLOSED","CLOSED","OPEN","OPEN","CLOSED","OPEN","OPEN"],["2022-08-27",25,15,10,"SSE","SSE","SSE","light snow","some clouds","clear",0,0,0,0,0,0,1750,1900,2100,"The Happy Valley beginner's area is now closed for the day due to full capacity. Sledding is unfortunately sold out for the day. We apologize for both of these inconveniences. The Sky Waka Gondola will open for sightseeing and access only. The Valley T and Knoll T will open for advanced upper mountain ski and riders only. Post last weeks big rain event the groomers are back out at the Far West working on trail and lift line re-building which is going well. Once completed we will need close to half a day to reset all safety trail and lift signage. We will have an update on progress at 10.30am. Come check out DJ Double Drop who will be playing on the Back Bar deck from 12pm today.","OPEN","CLOSED","OPEN","CLOSED","CLOSED","OPEN","OPEN","CLOSED","ON HOLD","OPEN"],["2022-08-26",30,15,15,"NNW","NNW","SE","light snow","mod. rain","light snow",1,0,4,2,9,0,2300,2350,1950,"Due to an increase in the wind and rain, we are closing Happy Valley and the Sky Waka for the day. Post the big rain event last week there is a significant amount of trail re-building work to be done. The timing of this work around freezing levels and weather forecasts is key. For the last 48 hours the groomers have been working on the Far West T line and trails. We are happy with where we are at and so are going to stay off everything today and let it snow. Even small amounts will make a quantum difference. Once the weather clears tomorrow, we will need a final clean up on push work and trail safety and signage will not to be put back in place which will all take half a day. Our goal here still is to have this operational sometime this weekend. We will continue with our updates here.","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED"],["2022-08-25",20,30,45,"N","NNE","NNW","cloudy","light snow","light snow",0,2,1,0,0,4,2150,2250,2300,"The Happy Valley beginner's area is open for ski and ride. If you are coming later today, please check the report first as we may run out of capacity. Also note that sledding is not available today. The Sky Waka Gondola will open for sightseeing and access only from 9am. The Valley T and Knoll T will open for advanced upper mountain ski and riders only from 9am. Post the big rain event the last week there is a significant amount of trail re-building work to be done. The timing of this work around freezing levels and weather forecasts is key. For the last 24 hours the groomers have been working on the Far West T line and trails. This work will continue today before we pull out once the weather hits. We then plan to resume tomorrow night. Our goal here still is to have this operational sometime this weekend. We will keep you updated here on progress.","OPEN","CLOSED","OPEN","CLOSED","CLOSED","OPEN","OPEN","CLOSED","CLOSED","OPEN"],["2022-08-24",25,30,15,"WNW","WNW","WNW","some clouds","cloudy","some clouds",0,0,0,0,0,0,2800,2550,2200,"The Happy Valley beginner's area is open for ski and ride. If you are coming later today, please check the report first as we may run out of capacity. Also note that sledding is not available today. The Sky Waka Gondola will open for sightseeing and access only from 9:30am. The Valley T will open for advanced upper mountain ski and ride from 9:30am. Post the big rain event the last week there is a significant amount of trail re-building work to be done. The timing of this work around freezing levels and weather forecasts is key. Last night the groomers worked on the Knoll T line and trails. This may be ready for re-opening later today. Work will resume today on the Far West T. Our goal here is to have this operational sometime this weekend. We will keep you updated here on progress.","OPEN","CLOSED","OPEN","CLOSED","CLOSED","OPEN","CLOSED","CLOSED","CLOSED","OPEN"],["2022-08-23",20,20,20,"S","SSW","WSW","light snow","some clouds","some clouds",0,0,0,0,0,0,1900,2200,2850,"The Happy Valley beginners area is open for ski and ride. Please note that sledding is not available today. The Sky Waka Gondola will open for sightseeing and access only from 10am. The Valley will re-open from 10.30am this morning. Now that the rain has eased there is a significant amount of trail re-building work to be done. The timing of this work around freezing levels and weather forecasts is key. Last night the groomers rebuilt the Valley T line and trails. This will be the only upper mountain lift facility available for at least the next few days. Work will resume today on the Knoll T. Our goal here is to have this operational in the next few days. Once done here we will move out to the Far West T. We will keep you updated here on progress.","OPEN","CLOSED","OPEN","CLOSED","CLOSED","OPEN","CLOSED","CLOSED","CLOSED","CLOSED"],["2022-08-22",20,25,15,"N","NNW","NNE","snow shwrs","some clouds","clear",2,0,0,0,0,0,2100,2200,2000,"The Happy Valley beginners area is open for ski and ride. Please note that there is no sledding available today. The Sky Waka is open for sightseeing only. Once the rain eases there will be a significant amount of trail re-building work to be done. The timing of commencing this work is key. And so today we will not have any terrain available on the upper mountain. With the temperature dropping tonight this looks like the right time for groomers to start push work and re-building on the Valley T. Our goal would be to have this ready to open sometime tomorrow. Once the Valley is done, we will keep working West onto the Knoll, and eventually onto the Far West. We will keep you updated here on progress.","OPEN","CLOSED","OPEN","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED"],["2022-08-21",45,45,30,"NW","NW","NW","cloudy","light snow","light snow",0,0,0,0,0,0,2400,2300,2300,"The Happy Valley beginners area will open for ski and ride, and sledding. All other facilities on the upper mountain are closed for the day due to poor weather conditions. Once the rain eases there will be a significant amount of trail re-building work to be done. We will keep you updated here on progress.","OPEN","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED"],["2022-08-20",65,55,50,"NNW","NNW","NW","mod. rain","mod. rain","rain shwrs",0,0,0,10,7,6,2700,3050,2500,"Due to poor weather conditions all facilities at Whakapapa are unfortunately closed for the day.","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED"],["2022-08-19",55,45,60,"NNW","N","N","light rain","light rain","rain shwrs",0,0,0,4,1,1,3950,4000,3850,"Due to poor weather conditions all facilities at Whakapapa are unfortunately closed for the day.","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED"],["2022-08-18",70,65,60,"N","N","NNW","heavy rain","heavy rain","heavy rain",0,0,0,15,23,31,3900,4050,4050,"Due to poor weather conditions all facilities at Whakapapa are unfortunately closed for the day.","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED"],["2022-08-17",65,55,60,"N","N","N","light rain","light rain","heavy rain",0,0,0,2,2,12,3000,3000,3100,"Unfortunately all facilities at Whakapapa are closed for the day due to poor weather conditions.","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED"],["2022-08-16",30,40,55,"N","N","N","cloudy","cloudy","light rain",0,0,0,0,0,2,2650,2750,2450,"We are OPEN with all lifts from 9am, please check below for specific times.","OPEN","OPEN","OPEN","OPEN","OPEN","OPEN","OPEN","CLOSED","OPEN","OPEN"],["2022-08-15",5,10,20,"WSW","N","NNW","cloudy","cloudy","some clouds",0,0,0,0,0,0,2450,2150,2350,"We are OPEN today and currently above the clouds. All lifts OPEN from 9am, please check below.","OPEN","OPEN","OPEN","OPEN","OPEN","OPEN","OPEN","CLOSED","OPEN","OPEN"],["2022-08-14",10,15,20,"WSW","NW","WNW","clear","clear","clear",0,0,0,0,0,0,2350,2450,2400,"We have another beautiful clear day on our maunga. Lifts will open from 8am - please check below for timing.","OPEN","OPEN","OPEN","OPEN","OPEN","OPEN","OPEN","CLOSED","OPEN","OPEN"],["2022-08-13",15,15,10,"SSW","SSW","SSW","clear","clear","clear",0,0,0,0,0,0,1300,1700,1900,"It is a stunning day on our maunga! Lifts will OPEN from 8am this morning! Welcome to Day 1 of the Far West T! Additional lifts today are the Rangatira and Cindertrack Carpet. DJ Double Drop and crew will be spinning some good vibe tunes on the Back Bar Deck at the Knoll for lunch. The day will finish with extended free twilight riding in HV and on the Rangatira - along with DJ DD spinning more tunes on the LBC Deck!!!!","OPEN","OPEN","OPEN","CLOSED","OPEN","OPEN","OPEN","CLOSED","OPEN","OPEN"],["2022-08-12",10,20,20,"SE","S","SSW","clear","clear","clear",0,0,0,0,0,0,1050,1400,900,"It is a beautiful cool, clear, and crisp morning on the maunga! Happy Valley is OPEN for beginner ski and ride, and sledding. The Sky Waka Gondola is open for sightseeing and access only. The Valley T and Knoll T, along with Day 1 of the Delta are open on the upper mountain. Work on the Far West will be completed today. We will have an update on this progress at 11am.","OPEN","CLOSED","OPEN","CLOSED","OPEN","OPEN","OPEN","CLOSED","ON HOLD","OPEN"],["2022-08-11",15,10,5,"SE","SE","SSE","clear","some clouds","clear",0,0,0,0,0,0,1100,1400,900,"It is a beautiful cool, clear, and crisp morning on the maunga! Happy Valley is OPEN for beginner ski and board, and sledding. The Sky Waka Gondola is open for sightseeing and access only. The Valley T and Knoll T are open. Work on the Far West is progressing well. Today and tomorrow, we will finish preoperational checks on the lift, trail building, and safety padding and signage. The building of some of the traverse trails is proving to be one of the more challenging final pieces of work.","OPEN","CLOSED","OPEN","CLOSED","CLOSED","OPEN","OPEN","CLOSED","CLOSED","OPEN"],["2022-08-10",10,5,10,"SSE","SSW","SSE","cloudy","cloudy","some clouds",0,0,0,0,0,0,1300,1450,1150,"It is a beautiful cool, clear, and crisp morning on the maunga! Happy Valley is OPEN for beginner ski and board, and sledding. Avalanche and de-icing is completed. We are on track to have T's open at 9.30am.","OPEN","CLOSED","OPEN","CLOSED","CLOSED","OPEN","OPEN","CLOSED","CLOSED","ON HOLD"],["2022-08-09",20,25,10,"ESE","ESE","SSE","light snow","light snow","cloudy",0,1,0,0,0,0,1800,1600,1350,"We are OPEN today with beginner ski and ride and sledding in Happy Valley. The Sky Waka gondola, Valley T and Knoll T are CLOSED for the day due to high winds.","OPEN","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED"],["2022-08-08",10,10,10,"NNE","NE","ENE","some clouds","light snow","cloudy",0,1,0,0,0,0,1900,1900,1900,"We are OPEN today with beginner ski and ride and sledding in Happy Valley. Sightseeing on the Sky Waka Gondola is OPEN. Valley T and Knoll T will OPEN at 10am once de-icing is complete. The Far West cable and boxes are on. Further work will now be deicing the lift over the next 2 days. With the weather clearing, alignment will need more work which will only then put us in a position to start working through our pre-operational checks. Alongside this the grooming team have been moving snow to build trails. In particular the Traverse of Fear, lower Turn Pipe, and the load area are all challenging jobs. We will have further updates through the week.","OPEN","CLOSED","OPEN","CLOSED","CLOSED","OPEN","OPEN","CLOSED","CLOSED","CLOSED"],["2022-08-07",45,30,10,"WNW","WNW","WNW","light snow","some clouds","some clouds",0,0,0,0,0,0,2050,2100,1950,"Unfortunately due to poor weather conditions all lift facilities are CLOSED for the day. The Far West cable and boxes are on. Work will now be focused on deicing the lift over the next 3-4 days. Once the weather clears, alignment will need to be completed which will only then put us in a position to start working through our pre-operational start-up checks. Alongside this the grooming team have been moving snow to build trails. In particular the Traverse of Fear, lower Turn Pipe, and the load area are all challenging jobs. Once trail building, t-lines, loads and unloads near completion, only then can Patrol start setting up signage, fencing, and padding. We will have further updates through the week.","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED"],["2022-08-06",35,40,50,"NW","NW","NW","cloudy","some clouds","heavy rain",0,0,0,0,0,11,3500,3300,2600,"It is a beautiful day on the maunga! Happy Valley is OPEN for beginner skiing, boarding, and sledding. The Sky Waka Gondola is OPEN for sightseeing and access only to the upper mountain. The Valley T and Knoll T are OPEN. Also come check out our Pop Up Terrain Park at the top of the Valley! The Far West cable is on. Work today will be alignment and connecting boxes. Alongside this the grooming team have been moving snow to build trails. In particular the Traverse of Fear, lower Turn Pipe, and the load area are all challenging jobs. Work on the lift and trails will continue today.","OPEN","CLOSED","OPEN","CLOSED","CLOSED","OPEN","OPEN","CLOSED","CLOSED","OPEN"],["2022-08-05",10,15,25,"NNW","NNW","NW","clear","some clouds","cloudy",0,0,0,0,0,0,3500,3550,3600,"It is a stunning day today on our maunga! Happy Valley is open for beginner ski and ride, and sledding. The Sky Waka is open for sightseeing and access only. The Valley T and Knoll T are open for upper mountain ski and ride. NEW today we have a Pop-up Park in the Valley which will open from mid-morning. Work on rolling the Far West cable went well yesterday. We now have the cable on the towers and up either end of the lift. Today's work will be to rig and tension the lift with a view to turn it later. We will need all of today and tomorrow to complete this job.","OPEN","CLOSED","OPEN","CLOSED","CLOSED","OPEN","OPEN","CLOSED","CLOSED",null],["2022-08-04",10,10,10,"W","WSW","SW","clear","clear","clear",0,0,0,0,0,0,2900,2950,3200,"It is a beautiful fine and clear day on our maunga! Happy Valley is open for beginner ski and ride, and sledding. The Sky Waka is open for sightseeing and access only. The Valley T is open for upper mountain ski and ride and with the hard off trail conditions we will only allow advanced riders lift access this morning. We are completing final set-up this morning on the Knoll T and hope to have this open just after lunch. We will have an update on progress at 10am. We will start work today on rolling out and rigging the Far West T cable! We will have regular updates on progress on this job as it progresses.","OPEN","CLOSED","OPEN","CLOSED","CLOSED","OPEN","ON HOLD","CLOSED","CLOSED",null],["2022-08-03",45,35,15,"WNW","W","W","cloudy","light snow","snow shwrs",0,0,0,0,0,0,2000,2200,2700,"Happy Valley is OPEN for beginner ski and board, and sledding. All upper mountain facilities are closed for the day due to poor weather conditions.","OPEN","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED",null],["2022-08-02",30,45,45,"WNW","NW","NW","cloudy","cloudy","light snow",0,0,0,0,0,0,1450,1600,1850,"We are OPEN today with beginner ski and ride and sledding in Happy Valley and sightseeing on the Sky Waka Gondola. We are just doing some final work on the Valley T and we will OPEN at 10am. There is enough snow now to complete final trail build and lift set up on the Knoll T! We expect to have this ready for operation in the next few days.","OPEN","CLOSED","OPEN","CLOSED","CLOSED","OPEN","CLOSED","CLOSED","CLOSED",null],["2022-08-01",25,20,25,"SW","WSW","WNW","some clouds","snow shwrs","some clouds",0,0,0,0,0,0,1250,1500,1400,"We are OPEN today with beginner ski and ride and sledding in Happy Valley, sightseeing on the Sky Waka Gondola. There is a significant amount of control work to be completed on the Valley T, we will have an update at 10am. There is enough snow now to complete final trail build and lift set up on the Knoll T! We expect to have this ready for operation in the next few days.","OPEN","CLOSED","OPEN","CLOSED","CLOSED","OPEN","CLOSED","CLOSED","CLOSED",null],["2022-07-31",50,30,30,"W","SW","WSW","light snow","snow shwrs","some clouds",5,4,0,0,0,0,1300,1000,1100,"Happy Valley is OPEN for beginner ski and ride, and sledding. Please dress warmly. All upper mountain lifts are closed for the day due to poor weather. We have received more snow overnight! We will adjust levels accurately once teams have had a good look around up top.","OPEN","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED",null],["2022-07-30",35,45,55,"NNW","NNW","NNW","light snow","snow shwrs","light snow",0,0,4,0,0,0,1850,2000,1800,"We have received over 30cms of snow on the upper mountain over the last few days! The Sky Waka Gondola is OPEN for sightseeing and access only to the upper mountain. Avalanche control work has been completed in the Valley. We have had a few deicing challenges and this is still in progress. We now expect this to be completed around 10.30am. Happy Valley is OPEN for beginner skiing and boarding, and sledding. We anticipate reaching capacity in Happy Valley mid to late morning so please check the report if you are planning on coming later in the day.","OPEN","CLOSED","OPEN","CLOSED","CLOSED","OPEN","CLOSED","CLOSED","CLOSED",null],["2022-07-29",45,40,40,"W","W","WNW","light snow","light snow","light snow",1,0,0,0,0,0,1650,1650,1850,"Happy Valley is OPEN for beginner skiing and boarding, and sledding. The Sky Waka Gondola and Valley T are CLOSED for the day due to poor weather conditions and high winds.","OPEN","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED",null],["2022-07-28",55,55,60,"NNW","WNW","WNW","light snow","light snow","light snow",2,2,4,0,0,0,2050,1800,1750,"Mōrena. Unfortunately due to poor weather conditions all lift facilities are CLOSED for the day.","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED",null],["2022-07-27",50,45,45,"WNW","WNW","NW","mod. snow","light snow","light snow",6,1,1,0,0,0,2300,2050,1900,"Due to poor weather conditions all lift facilities are unfortunately CLOSED for the day.","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED",null],["2022-07-26",50,45,35,"NNE","N","NNW","rain shwrs","light snow","mod. snow",0,1,9,7,0,0,2600,2250,2250,"Happy Valley is OPEN for beginner ski and board, and sledding. The Sky Waka and Valley T is CLOSED today due to poor weather conditions.","OPEN","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED",null],["2022-07-25",40,45,70,"NE","NNE","NNE","light snow","light snow","heavy rain",4,1,0,0,0,21,1800,3100,3000,"The Sky Waka Gondola is OPEN for sightseeing and snow play, Happy Valley is OPEN for beginner ski and board, and sledding. The Valley T is currently ON HOLD while we assess conditions with an update at 10am.","OPEN","CLOSED","OPEN","CLOSED","CLOSED","ON HOLD","CLOSED","CLOSED","CLOSED",null],["2022-07-24",15,15,25,"NNE","NNE","NNE","cloudy","cloudy","cloudy",0,0,0,0,0,0,1900,2000,1900,"It is another stunning day on our maunga! The Sky Waka Gondola is OPEN for sightseeing, snow play, and access to the upper mountain where we have the Valley T OPEN. Happy Valley is OPEN for beginner ski and board, and sledding.","OPEN","CLOSED","OPEN","CLOSED","CLOSED","OPEN","CLOSED","CLOSED","CLOSED",null],["2022-07-23",10,5,10,"NNE","NNE","NNE","some clouds","some clouds","cloudy",0,0,0,0,0,0,1800,1950,1950,"It is a stunning day on the maunga! We are pleased to be OPENING the Valley T today for the first time this season. Happy Valley is OPEN for beginner ski and ride, and sledding. We anticipate reaching full capacity in Happy Valley around mid morning. The Sky Waka Gondola is OPEN for access to the upper mountain and for sightseeing and snow play.","OPEN","CLOSED","OPEN","CLOSED","CLOSED","OPEN","CLOSED","CLOSED","CLOSED",null],["2022-07-22",25,15,5,"S","SSE","SE","clear","clear","clear",0,0,0,0,0,0,1200,1300,1250,"Happy Valley is OPEN for beginner skiing and boarding, and sledding. The Sky Waka Gondola will OPEN for SIGHTSEEING only from 10am once de-icing and snow clearing are complete. We have received over 10cms of snow over the last 24 hours. This is enough for us to complete final push work and preparation to open the Valley T Bar tomorrow!","OPEN","CLOSED","OPEN","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED",null],["2022-07-21",50,55,35,"W","SSW","S","light snow","mod. snow","snow shwrs",2,7,1,0,0,0,1250,1250,1050,"Happy Valley is OPEN for beginner skiing and boarding, and sledding. The forecast is for snow throughout the day so please dress warmly. The Sky Waka Gondola is CLOSED for the day.","OPEN","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED",null],["2022-07-20",25,25,30,"NNE","NW","W","light rain","light snow","light snow",0,3,3,4,0,0,2400,2200,1350,"We are OPEN for beginner ski and board, and sledding in Happy Valley. With early season snow conditions alongside a busy school holidays we would expect to reach capacity in Happy Valley later this morning. Please check this report for up to date information. the Sky Waka Gondola is ON HOLD due to poor weather conditions. This will be constantly assessed and we will have a update before 8am.","OPEN","CLOSED","OPEN","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED",null],["2022-07-19",55,45,45,"NNW","NNW","NNW","light snow","light snow","light rain",0,0,0,0,0,4,2050,2200,2300,"We are OPEN today with beginner ski and ride, sledding, and sightseeing on the Sky Waka Gondola. . Due to the lack of snow, Mini X has been postponed. It is now scheduled to run this Thursday if conditions allow. We apologise for any inconvenience.","OPEN","CLOSED","OPEN","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED",null],["2022-07-18",40,40,60,"NNW","NNW","NNW","some clouds","clear","light snow",0,0,0,0,0,0,2100,1500,2100,"It is a stunning cool, crisp, and clear day on the maunga! The Sky Waka Gondola is OPEN for sightseeing. Take a ride on NZ's biggest gondola with spectacular views and a designated safe snow play area at the top. Due to the lack of snow, Mini X has been postponed. It is now scheduled to run this Thursday if conditions allow. We apologise for any inconvenience.","OPEN","CLOSED","OPEN","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED",null],["2022-07-17",10,15,25,"SW","WNW","NW","clear","clear","some clouds",0,0,0,0,0,0,1600,1750,2100,"It is a stunning cool, crisp, and clear day on the maunga! The Sky Waka Gondola is OPEN for sightseeing. Take a ride on NZ's biggest gondola with spectacular views and a designated safe snow play area at the top. With numbers for the school holidays alongside limited early season snow we anticipate reaching capacity in the Happy Valley beginners area sometime this morning. Sledding is already sold out. We will keep you updated here. We apologize for any inconvenience.","OPEN","CLOSED","OPEN","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED",null],["2022-07-16",25,25,15,"WSW","SW","WSW","snow shwrs","snow shwrs","clear",0,0,0,0,0,0,1250,1450,1300,"We had a dusting of fresh snow overnight! The Sky Waka Gondola is OPEN for sightseeing. Take a ride on NZ's biggest gondola with spectacular views and a designated safe snow play area at the top. Unfortunately, due to numbers for the school holidays alongside limited early season snow we have CLOSED off any further capacity and access to Happy Valley including sledding. Pre-purchased online tickets and or lessons will still have access. We will constantly monitor this, and should we free up capacity tickets will become available later from the mountain only. We apologize for any inconvenience.","CLOSED","CLOSED","OPEN","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED",null],["2022-07-15",10,15,20,"SSW","WSW","W","light snow","some clouds","snow shwrs",0,0,0,0,0,0,1500,1650,1350,"Unfortunately, due to numbers for the school holidays alongside limited early season snow we have CLOSED off any further capacity and access to our beginner area. Pre-purchased online tickets and or lessons will still have access. We will constantly monitor this, and should we free up capacity tickets will become available later from the mountain only. We will have an update at 1pm. We apologize for any inconvenience. The Sky Waka Gondola is OPEN for sightseeing. There is a snow play area at the top of the Sky Waka.","CLOSED","CLOSED","OPEN","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED",null],["2022-07-14",30,5,20,"WNW","NW","ESE","cloudy","cloudy","heavy snow",0,0,21,0,0,0,2050,2250,1650,"We are OPEN today with beginner ski and ride and sledding in the Happy Valley Beginners Area. The Sky Waka Gondola is OPEN for sightseeing only.","OPEN","CLOSED","OPEN","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED",null],["2022-07-13",50,40,40,"WNW","WNW","WNW","light snow","snow shwrs","snow shwrs",0,0,0,0,0,0,2100,2200,2050,"We are OPEN today with beginner ski and ride, sledding, and sightseeing on the Sky Waka Gondola.","OPEN","CLOSED","OPEN","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED",null],["2022-07-12",70,45,70,"NNE","NW","WNW","heavy rain","light snow","mod. snow",0,1,9,12,15,0,3300,2350,1850,"ALL facilities are CLOSED today due tom poor weather conditions.","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED",null],["2022-07-11",20,20,45,"NE","NNE","NNE","light snow","light rain","heavy rain",0,0,0,0,1,21,2200,2700,3000,"We are OPEN today with beginner ski and ride, sledding, and sightseeing on the Sky Waka Gondola. There is a dedicated snow play area at the top of the Sky Waka. Unfortunately there are a few facilities closed today.","OPEN","CLOSED","OPEN","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED",null],["2022-07-10",20,15,15,"NW","NNW","NNE","light snow","snow shwrs","cloudy",1,0,0,0,0,0,2000,2050,2200,"We are OPEN today with beginner ski and ride, sledding, and sightseeing on the Sky Waka Gondola. There is a dedicated snow play area at the top of the Sky Waka.","OPEN","CLOSED","OPEN","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED",null],["2022-07-09",65,65,40,"WNW","WNW","WNW","light snow","light snow","light snow",1,1,1,0,0,0,1950,1950,1850,"We are OPEN today with beginner ski and ride, and sledding. Due to the heavy rain last night there will be a slight delay with opening for some repair work. The Sky Waka Gondola is CLOSED today due to poor weather conditions.","OPEN","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED",null],["2022-07-08",60,65,55,"NNW","NNW","NW","mod. rain","mod. rain","light snow",0,0,2,10,7,6,3500,2950,2250,"We are OPEN today with beginner ski and ride, and sledding. The Sky Waka Gondola is CLOSED today due to poor weather conditions.","OPEN","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED",null],["2022-07-07",10,5,15,"WSW","NNW","N","some clouds","cloudy","cloudy",0,0,0,0,0,0,2750,2800,2800,"We are OPEN today with beginner ski and ride, sledding, and sightseeing on the Sky Waka Gondola.","OPEN","CLOSED","OPEN","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED",null],["2022-07-06",10,10,10,"SSE","SW","W","some clouds","some clouds","some clouds",0,0,0,0,0,0,3050,2800,2750,"We are OPEN today with beginner ski and ride, sledding, and sightseeing on the Sky Waka Gondola.","OPEN","CLOSED","OPEN","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED",null],["2022-07-05",30,35,35,"NNW","NW","WNW","light snow","light snow","mod. rain",0,1,0,0,5,8,2100,2250,2600,"We are OPEN today with beginner ski and ride, sledding, and sightseeing on the Sky Waka Gondola.","OPEN","CLOSED","OPEN","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED",null],["2022-07-04",20,5,30,"SSE","NNW","NNW","clear","some clouds","cloudy",0,0,0,0,0,0,2700,2850,2700,"We are OPEN today with beginner ski and ride, sledding, and sightseeing on the Sky Waka Gondola.","OPEN","CLOSED","OPEN","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED",null],["2022-07-03",20,30,30,"WSW","WSW","SW","clear","some clouds","some clouds",0,0,0,0,0,0,1550,1850,1700,"We are OPEN today with beginner ski and ride, sledding, and sightseeing on the Sky Waka Gondola.","OPEN","CLOSED","OPEN","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED",null],["2022-07-02",10,10,20,"SW","WNW","WNW","clear","clear","clear",0,0,0,0,0,0,1600,2150,1600,"We are OPEN today with beginner ski and ride, sledding, and sightseeing on the Sky Waka Gondola.","OPEN","CLOSED","OPEN","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED",null],["2022-07-01",45,30,35,"WSW","WSW","WSW","some clouds","cloudy","cloudy",0,0,0,0,0,0,1400,1600,1350,"We are OPEN today with beginner ski and ride, sledding, and sightseeing on the Sky Waka Gondola.","OPEN","CLOSED","OPEN","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED",null],["2022-06-30",20,30,45,"S","SW","WSW","clear","some clouds","snow shwrs",0,0,0,0,0,0,2400,2850,2100,"We are OPEN today with beginner ski and ride, and sightseeing on the Sky Waka Gondola.","OPEN","CLOSED","OPEN","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED",null],["2022-06-29",20,10,10,"NW","WNW","S","cloudy","light snow","snow shwrs",0,0,0,0,0,0,2100,2100,2200,"We are OPEN today with beginner ski and ride, and sightseeing on the Sky Waka Gondola. If you are coming and planning on sledding, or needing a lesson, we recommend going on-line and booking ahead of time.","OPEN","CLOSED","OPEN","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED",null],["2022-06-28",15,10,20,"NW","NW","NW","cloudy","some clouds","some clouds",0,0,0,0,0,0,2250,2150,2150,"We are OPEN today with beginner ski and ride, and sightseeing on the Sky Waka Gondola. If you are coming and planning on sledding, or needing a lesson, we would recommend going on line and booking ahead of time.","OPEN","CLOSED","OPEN","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED",null],["2022-06-27",20,15,15,"WSW","W","WNW","clear","some clouds","cloudy",0,0,0,0,0,0,2350,2350,2500,"We are OPEN today with beginner ski and ride, and sightseeing on the Sky Waka Gondola. If you are coming and planning on sledding, or needing a lesson, we would recommend going on line and booking ahead of time.","OPEN","CLOSED","OPEN","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED",null],["2022-06-26",15,10,15,"WSW","WSW","SW","cloudy","clear","clear",0,0,0,0,0,0,2200,2200,2400,"We are OPEN today with beginner ski and ride, and sightseeing on the Sky Waka Gondola. If you are coming and planning on lunch at the Pinnacles, sledding, or needing a lesson, we would recommend going on line and booking ahead of time.","OPEN","CLOSED","OPEN","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED",null],["2022-06-25",35,15,15,"NNW","NW","WNW","light snow","cloudy","some clouds",0,0,0,0,0,0,2150,2150,2200,"We are OPEN today with beginner ski and ride, and sightseeing on the Sky Waka Gondola. Please note that the Pinnacles Restaurant, sledding, and ski and ride lessons must be booked on line.","OPEN","CLOSED","OPEN","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED",null],["2022-06-24",15,20,40,"N","N","N","some clouds","some clouds","light snow",0,0,0,0,0,0,1850,2050,2100,"We are OPEN today with beginner ski and ride, sledding, and sightseeing on the Sky Waka Gondola are OPEN.","OPEN","CLOSED","OPEN","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED",null],["2022-06-23",5,5,15,"ENE","NE","NNW","some clouds","some clouds","clear",0,0,0,0,0,0,2000,1950,1950,"We are OPEN today with beginner ski and ride, sledding, and sightseeing on the Sky Waka Gondola are OPEN.","OPEN","CLOSED","OPEN","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED",null],["2022-06-22",15,10,10,"ESE","ESE","ESE","clear","clear","some clouds",0,0,0,0,0,0,1800,2100,2250,"We are OPEN today with beginner ski and ride, sledding, and sightseeing on the Sky Waka Gondola are OPEN.","OPEN","CLOSED","OPEN","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED",null],["2022-06-21",20,10,15,"ESE","SE","SE","clear","clear","clear",0,0,0,0,0,0,1150,1400,1300,"We are OPEN today with beginner ski and ride, sledding, and sightseeing on the Sky Waka Gondola.","OPEN","CLOSED","OPEN","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED",null],["2022-06-20",50,45,35,"SE","SE","ESE","light snow","light snow","snow shwrs",0,0,0,0,0,0,1200,1000,950,"We are OPEN today with beginner ski and ride, sledding. Due to strong wind the Sky Waka is closed today.","OPEN","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED",null],["2022-06-19",5,5,20,"SE","SSE","SSE","cloudy","light snow","some clouds",0,0,0,0,0,0,2000,1650,1300,"We are OPEN today with beginner ski and ride, sledding and sightseeing on the Sky Waka.","OPEN","CLOSED","OPEN","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED",null],["2022-06-18",20,15,5,"NNW","NNW","NNW","some clouds","cloudy","mod. snow",0,0,6,0,0,2,2200,2300,2250,"We are OPEN today with beginner ski and ride, sledding, and sightseeing on the Sky Waka Gondola.","OPEN","CLOSED","OPEN","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED",null],["2022-06-17",25,10,25,"W","WNW","NNW","light snow","light snow","light snow",1,0,1,0,0,0,2200,2200,2200,"We are OPEN today with beginner ski and ride, and sledding. The Sky Waka Gondola is currently ON HOLD while we de-ice the lift along with weather checks. We will have a final update at 10am.","OPEN","CLOSED","ON HOLD","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED",null],["2022-06-16",35,40,30,"W","W","W","cloudy","light snow","snow shwrs",0,0,0,0,0,0,1750,1850,2000,"Due to poor weather conditions all facilities are CLOSED for the day. Please check back tomorrow for an updated report.","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED",null],["2022-06-15",50,55,55,"WSW","WSW","WSW","light snow","light snow","light snow",0,0,0,0,0,0,1800,1800,1850,"Due to poor weather conditions all facilities are CLOSED for the day. Please check back tomorrow for an updated report.","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED",null],["2022-06-14",60,60,55,"WSW","W","W","light snow","light snow","light snow",0,0,1,0,0,0,1450,1650,1800,"Due to poor weather conditions all facilities are CLOSED for the day. The good news is we have had snow top to bottom overnight!","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED",null],["2022-06-13",70,75,50,"WNW","WNW","WSW","mod. snow","light snow","light snow",5,4,4,0,0,0,1350,1400,1550,"Due to poor weather conditions all facilities are CLOSED for the day. The good news is we have had snow top to bottom overnight!","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED",null],["2022-06-12",40,65,90,"NNW","NW","NNW","light snow","light snow","heavy snow",5,3,20,0,0,0,1950,1850,2150,"Due to poor weather conditions all facilities are CLOSED for the day. The good news is we have had snow top to bottom overnight! We have beginner ski and ride, sledding, and Sky Waka Gondola sightseeing available weather permitting from 3 June with more facilities coming online later in the month as the snow base builds.","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED",null],["2022-06-11",70,65,50,"NW","WNW","NW","light snow","light snow","light snow",3,2,3,0,0,0,1950,1900,1750,"Due to poor weather conditions all facilities are CLOSED for the day. We have beginner ski and ride, sledding, and Sky Waka Gondola sightseeing available weather permitting from 3 June with more facilities coming online later in the month as the snow base builds.","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED",null],["2022-06-10",70,55,60,"NW","WNW","NW","mod. snow","light snow","light snow",5,2,3,0,0,0,2050,1850,1950,"","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED",null],["2022-06-09",50,65,50,"NNW","NW","WNW","light snow","light snow","light snow",2,5,2,0,0,0,2150,2000,1750,"","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED",null],["2022-06-08",25,30,45,"NW","WNW","NW","clear","clear","light snow",0,0,2,0,0,0,2550,2300,2200,"","OPEN","CLOSED","OPEN","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED",null],["2022-06-07",35,45,50,"N","N","NNW","some clouds","light rain","rain shwrs",0,0,0,0,1,11,3100,2950,2700,"","OPEN","CLOSED","OPEN","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED",null],["2022-06-06",20,15,35,"N","N","N","light snow","cloudy","rain shwrs",0,0,0,1,0,1,2300,2400,2600,"","OPEN","CLOSED","OPEN","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED",null],["2022-06-05",20,25,35,"N","N","N","cloudy","cloudy","light snow",0,0,0,0,0,0,2700,2650,2350,"","OPEN","CLOSED","OPEN","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED",null],["2022-06-04",10,10,5,"SSW","S","NNE","snow shwrs","clear","some clouds",0,0,0,0,0,0,1900,2150,2600,"","OPEN","CLOSED","OPEN","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED","CLOSED",null]]}